% This is part of Exercices et corrigés de CdI-1
% Copyright (c) 2011
%   Laurent Claessens
% See the file fdl-1.3.txt for copying conditions.

\begin{corrige}{OutilsMath-0056}

    Nous utilisons la formule d'approximation \eqref{EqFormApproxfxyabDFOM} avec trois variables au lieu de deux. Nous avons l'approximation
    \begin{equation}
        \begin{aligned}[]
            f(1.0001,1.999,2.98)&=f(1,2,3)+0.0001\frac{ \partial f }{ \partial x }(1,2,3)\\
            &\quad -0.0001\frac{ \partial f }{ \partial y }(1,2,3)\\
            &\quad -0.02\frac{ \partial f }{ \partial z }(1,2,3).
        \end{aligned}
    \end{equation}
    Les dérivées partielles se calculent facilement
    \begin{verbatim}
----------------------------------------------------------------------
| Sage Version 4.6.1, Release Date: 2011-01-11                       |
| Type notebook() for the GUI, and license() for information.        |
----------------------------------------------------------------------
sage: a(x)=x*exp(x)
sage: f(x,y,z)=a(x)+a(y)+a(z)
sage: f
(x, y, z) |--> x*e^x + y*e^y + z*e^z
sage: f(1,2,3)
e + 2*e^2 + 3*e^3
sage: f.diff(x)(1,2,3)
2*e
sage: f.diff(y)(1,2,3)
3*e^2
sage: f.diff(z)(1,2,3)
4*e^3
    \end{verbatim}
    Notez la petite astuce de définir \info{a(x)=x*exp(x)} pour ne pas devoir taper trois fois la même expression. Nous avons donc comme approximation :
    \begin{equation}
        e+2e^2+3e^3+\frac{ 2e }{ 10000 }-\frac{ 3e^2 }{ 10000 }-\frac{ 2 }{ 100 }4e^3=\frac{ 5001 }{ 5000 }e+\frac{ 19997 }{ 10000 }e^2+\frac{ 77 }{ 25 }e^3.
    \end{equation}

\end{corrige}
