\begin{corrige}{GeomAnal-0045}

            Nous avons
            \begin{equation}
                f(t,at)=\frac{ t^7a^5 }{ 4t^4+a^{10}t^{10} }=\frac{ t^3a^5 }{ 4+a^{10}t^6 }\to 0.
            \end{equation}
            Il y a plusieurs façon de trouver des chemins sur lesquels la limite ne vaut pas zéro. Une façon (pas la plus simple) est de chercher un chemin de la forme \( \gamma(t)=(t,a(t)t)\) et résoudre l'équation
            \begin{equation}
                \frac{ t^3a^5 }{ 4+a^{10}t^6 }=\alpha               
            \end{equation}
            pour trouver \( a(t)\). La résolution est un peu longuette, et en posant \( y=a^5\) nous trouvons
            \begin{equation}
                y=\frac{ t^5\pm\sqrt{t^6(1-16\alpha^2)} }{ 2\alpha t^6 }.
            \end{equation}
            Si \( \alpha\) est assez petit cela existe et définit bien \( a(t)\). Le long du chemin ainsi construit nous aurons \( \lim_{t\to 0} f(t,a(t)t)=\alpha\).

            Sinon avec un peu de flair on peut essayer \( (t,t^{2/5})\) pour qui la limite est \( 1/5\).

            \begin{verbatim}
---------------------------------------------------------------------
| Sage Version 4.7.1, Release Date: 2011-08-11                       |
| Type notebook() for the GUI, and license() for information.        |
----------------------------------------------------------------------
sage: f(x,y)=x**2*y**5/(4*x**4+y**10)
sage: t=var('t')
sage: f(t,t**(5/2))
t^(29/2)/(t^25 + 4*t^4)
sage: f(t,t**(5/2)).limit(t=0)
0
sage: f(t,t**(2/5)).limit(t=0)
1/5
            \end{verbatim}

\end{corrige}
