% This is part of Exercices et corrigés de CdI-1
% Copyright (c) 2011
%   Laurent Claessens
% See the file fdl-1.3.txt for copying conditions.

\begin{corrige}{OutilsMath-0095}

    Les dérivées partielles de $f$ sont :
    \begin{equation}
        \begin{aligned}[]
            \frac{ \partial f }{ \partial x }&=2y^3z\cos(xyz)+2xyz\\
            \frac{ \partial f }{ \partial y }&=2xy^2z\cos(xyz)+x^2z+4y\sin(xyz)\\
            \frac{ \partial f }{ \partial z }&=2xy^3\cos(xyz)+x^2y.
        \end{aligned}
    \end{equation}
    Nous avons donc
    \begin{equation}
        \begin{aligned}[]
            \frac{ \partial f }{ \partial x }(1,1,\pi)&=0,&\frac{ \partial f }{ \partial y }(1,1,\pi)&=-\pi,&\frac{ \partial f }{ \partial z }(1,1,\pi)&=-1.
        \end{aligned}
    \end{equation}
    La différentielle est donc donnée par
    \begin{equation}
        df_{(1,1,\pi)}(u)=-\pi u_2-u_3.
    \end{equation}
    L'approximation est
    \begin{equation}
        \begin{aligned}[]
            f(1+10^{-2},1-10^{-3},\pi+10^{-4})&\simeq f(1,1,\pi)-10^{-3}(-\pi)+10^{-4}(-1)\\
                    &=\pi(1+10^{-3})-10^{-4}.
        \end{aligned}
    \end{equation}
    
    En ce qui qui concerne la circulation de $\nabla f$, nous avons un potentiel ($f$) est donc pas de problèmes :
    \begin{equation}
        \int_{\sigma}\nabla f=f(1,1,\frac{ \pi }{2})-f(1,2,\pi)=\frac{ \pi }{2}+2-\left( -\frac{ 3\pi }{2}+2 \right)=-\frac{ 3\pi }{2}+2.
    \end{equation}

    Les calculs peuvent être faits avec Sage :
    \begin{verbatim}
----------------------------------------------------------------------
| Sage Version 4.6.1, Release Date: 2011-01-11                       |
| Type notebook() for the GUI, and license() for information.        |
----------------------------------------------------------------------
sage: f(x,y,z)=x**2*y*z+2*y**2*sin(x*y*z)
sage: f.diff(x)
(x, y, z) |--> 2*y^3*z*cos(x*y*z) + 2*x*y*z
sage: f.diff(y)
(x, y, z) |--> 2*x*y^2*z*cos(x*y*z) + x^2*z + 4*y*sin(x*y*z)
sage: f.diff(z)
(x, y, z) |--> 2*x*y^3*cos(x*y*z) + x^2*y
sage: f.diff(x)(1,1,pi)
0
sage: f.diff(x)(x=1,y=1,z=pi)
0
sage: f.diff(x)
sage: f.diff(y)(x=1,y=1,z=pi)
-pi
sage: f.diff(z)(x=1,y=1,z=pi)
-1
sage: f(1,1,pi)
pi
sage: f(1,1,pi/2)
1/2*pi + 2
sage: f(1,2,pi)  
2*pi
sage: f(1,1,pi/2)-f(1,2,pi)
-3/2*pi + 2
    \end{verbatim}
    Notez les deux possibilités pour calculer $\partial_xf(a,b,c)$. On peut écrire \info{f.diff(x)(a,b,c)} ou bien $\info{f.diff(x)(x=a,y=b,z=c)}$.
    

\end{corrige}
